[
    {
      "quote": "Those who remember Allah (always, and in prayers) standing, sitting, and lying down on their sides, and think deeply about the creation of the heavens and the earth, (saying): 'Our Lord! You have not created (all) this without purpose, glory to You! (Exalted be You above all that they associate with You as partners). Give us salvation from the torment of the Fire.'",
      "original_arabic": "الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
      "source": "Quran 3:191 (Muhsin Khan translation)"
    },
    {
      "quote": "Our Lord! Verily, whom You admit to the Fire, indeed, You have disgraced him, and never will the Zalimun (polytheists and wrong-doers) find any helpers.",
      "original_arabic": "رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ",
      "source": "Quran 3:192 (Muhsin Khan translation)"
    },
    {
      "quote": "Our Lord! Verily, we have heard the call of one (Muhammad SAW) calling to Faith: 'Believe in your Lord,' and we have believed. Our Lord! Forgive us our sins and remit from us our evil deeds, and make us die in the state of righteousness along with Al-Abrar (those who are obedient to Allah and follow strictly His Orders).",
      "original_arabic": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ",
      "source": "Quran 3:193 (Muhsin Khan translation)"
    },
    {
      "quote": "Our Lord! Grant us what You promised unto us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise.",
      "original_arabic": "رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
      "source": "Quran 3:194 (Muhsin Khan translation)"
    },
    {
      "quote": "Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.'",
      "original_arabic": "الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
      "source": "Quran 2:156 (Muhsin Khan translation)"
    },
    {
      "quote": "Indeed, I have turned my face towards He who created the heavens and the earth, inclining towards truth, and I am not of those who associate others with Allah.",
      "original_arabic": "إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ",
      "source": "Quran 6:79 (Sahih International translation)"
    },
    {
      "quote": "Say (O Muhammad Peace be upon him to the Jews and Christians), 'Dispute you with us about Allah while He is our Lord and your Lord? And we are to be rewarded for our deeds and you for your deeds. And we are sincere to Him in worship and obedience (i.e. we worship Him Alone and none else, and we obey His Orders).'",
      "original_arabic": "قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ",
      "source": "Quran 2:139 (Muhsin Khan translation)"
    },
    {
      "quote": "Our Lord! We believe in what You have sent down, and we follow the Messenger ['Iesa (Jesus)]; so write us down among those who bear witness (to the truth i.e. La ilaha ill-Allah - none has the right to be worshipped but Allah).",
      "original_arabic": "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
      "source": "Quran 3:89 (Muhsin Khan translation)"
    },
    {
      "quote": "We should have invented a lie against Allah if we returned to your religion, after Allah has rescued us from it. And it is not for us to return to it unless Allah, our Lord, should will. Our Lord comprehends all things in His Knowledge. In Allah (Alone) we put our trust. Our Lord! Judge between us and our people in truth, for You are the Best of those who give judgment.",
      "original_arabic": "قَدِ افْتَرَيْنَا عَلَى اللَّهِ كَذِبًا إِنْ عُدْنَا فِي مِلَّتِكُم بَعْدَ إِذْ نَجَّانَا اللَّهُ مِنْهَا وَمَا يَكُونُ لَنَا أَن نَّعُودَ فِيهَا إِلَّا أَن يَشَاءَ اللَّهُ رَبُّنَا وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
      "source": "Quran 7:89 (Muhsin Khan translation)"
    },
    {
      "quote": "Say (O Muhammad SAW): 'This is my way; I invite unto Allah (i.e. to the Oneness of Allah - Islamic Monotheism) with sure knowledge, I and whosoever follows me (also must invite others to Allah i.e. to the Oneness of Allah - Islamic Monotheism) with sure knowledge. And Glorified and Exalted be Allah (above all that they associate as partners with Him). And I am not of the Mushrikun (polytheists, pagans, idolaters and disbelievers in the Oneness of Allah; those who worship others along with Allah or set up rivals or partners to Allah)'.",
      "original_arabic": "قُلْ هَٰذِهِ سَبِيلِي أَدْعُو إِلَى اللَّهِ عَلَىٰ بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي وَسُبْحَانَ اللَّهِ وَمَا أَنَا مِنَ الْمُشْرِكِينَ",
      "source": "Quran 12:108 (Muhsin Khan translation)"
    },
    {
      "quote": "And We made firm their hearts when they stood up and said, 'Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.'",
      "original_arabic": "وَرَبَطْنَا عَلَىٰ قُلُوبِهِمْ إِذْ قَامُوا فَقَالُوا رَبُّنَا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ لَن نَّدْعُوَ مِن دُونِهِ إِلَٰهًا لَّقَدْ قُلْنَا إِذًا شَطَطًا",
      "source": "Quran 18:14 (Sahih International translation)"
    },
    {
      "quote": "Say, [O Muhammad], 'Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.'",
      "original_arabic": "قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَّهُ الدِّينَ",
      "source": "Quran 39:11 (Sahih International translation)"
    },
    {
      "quote": "So if they dispute with you (Muhammad SAW) say: 'I have submitted myself to Allah (in Islam), and (so have) those who follow me.' And say to those who were given the Scripture (Jews and Christians) and to those who are illiterates (Arab pagans): 'Do you (also) submit yourselves (to Allah in Islam)?' If they do, they are rightly guided; but if they turn away, your duty is only to convey the Message; and Allah is All-Seer of (His) slaves.",
      "original_arabic": "فَإِنْ حَاجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِ وَقُل لِّلَّذِينَ أُوتُوا الْكِتَابَ وَالْأُمِّيِّينَ أَأَسْلَمْتُمْ فَإِنْ أَسْلَمُوا فَقَدِ اهْتَدَوا وَّإِن تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ",
      "source": "Quran 3:20 (Muhsin Khan translation)"
    },
    {
      "quote": "Say (O Muhammad SAW): 'Verily, my Salat (prayer), my sacrifice, my living, and my dying are for Allah, the Lord of the 'Alamin (mankind, jinns and all that exists). He has no partner. And of this I have been commanded, and I am the first of the Muslims.'",
      "original_arabic": "قُلْ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ۝لَا شَرِيكَ لَهُ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ",
      "source": "Quran 6:162-163 (Muhsin Khan translation)"
    },
    {
      "quote": "Say: 'Shall I seek a lord other than Allah, while He is the Lord of all things? No person earns any (sin) except against himself (only), and no bearer of burdens shall bear the burden of another. Then unto your Lord is your return, so He will tell you that wherein you have been differing.'",
      "original_arabic": "لَا شَرِيكَ لَهُ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ",
      "source": "Quran 6:164 (Muhsin Khan translation)"
    },
    {
      "quote": "Verily, my Wali (Protector, Supporter, and Helper, etc.) is Allah Who has revealed the Book (the Quran), and He protects (supports and helps) the righteous.",
      "original_arabic": "إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ",
      "source": "Quran 7:196 (Muhsin Khan translation)"
    }
]